---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveOrientationType
source: html/03e7af77-1c61-bc87-95d9-daa5d2ae8d23.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveOrientationType Property

"Orients to"

## Syntax (C#)
```csharp
public static ForgeTypeId PointAdaptiveOrientationType { get; }
```